dependencies/axiom/1.2.11-wso2v5/modules/axiom-api/src/test/resources/soap/soapmessage.xml

<!--
  ~ Licensed to the Apache Software Foundation (ASF) under one
  ~ or more contributor license agreements. See the NOTICE file
  ~ distributed with this work for additional information
  ~ regarding copyright ownership. The ASF licenses this file
  ~ to you under the Apache License, Version 2.0 (the
  ~ "License"); you may not use this file except in compliance
  ~ with the License. You may obtain a copy of the License at
  ~
  ~ http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing,
  ~ software distributed under the License is distributed on an
  ~ "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
  ~ KIND, either express or implied. See the License for the
  ~ specific language governing permissions and limitations
  ~ under the License.
  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
    <soapenv:Header>
        <wsa:MessageID soapenv:mustUnderstand="0">
            uuid:920C5190-0B8F-11D9-8CED-F22EDEEBF7E5</wsa:MessageID>
        <wsa:To soapenv:mustUnderstand="0">
            http://localhost:8081/axis/services/BankPort</wsa:To>
        <wsa:From soapenv:mustUnderstand="0">
            <Address xmlns="http://schemas.xmlsoap.org/ws/2004/03/addressing">
                http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous
            </Address>
        </wsa:From>
    </soapenv:Header>
    <soapenv:Body>
        <axis2:echoVoid xmlns:axis2="http://ws.apache.org/axis2">
        </axis2:echoVoid>
    </soapenv:Body>
</soapenv:Envelope>